#include<stdio.h>
#include<stdlib.h>
#include<math.h>
#include<locale.h>

int main(){
	setlocale(LC_ALL, "Rus");
	double x1,x2,y1,y2,P,v1,v2,v3;
	
	printf("x1=");
	scanf("%lf",&x1);
	printf("x2=");
	scanf("%lf",&x2);
	printf("y1=");
	scanf("%lf",&y1);
	printf("y2=");
	scanf("%lf",&y2);
	
	v1=sqrt((x2*x2-2*x1*x2+x1*x1)+(y2*y2-2*y2*y1+y1*y1)),\
	printf("v1=%lf\n",v1);
	v2=sqrt(x2*x2+y2*y2),\
	printf("v2=%lf\n",v2);
	v3=sqrt(x1*x1+y1*y1),\
	printf("v3=%lf\n",v3);
	
	P=v1+v2+v3;
	
	if((0-y1)/(y2-y1)==(0-x1)/(x2-x1))
	{
			printf("Точки лежат на одной прямой\n");
	}
	if((0-y1)/(y2-y1)!=(0-x1)/(x2-x1))
	{
		if(x1>0 && y1>0 && x2>0 && y2>0)
		{
		printf("Точки лежат в 1-ой четверти.\nПериметр треугольника=%lf\n",P);
		}
		if(x1>0 && y1<0 && x2>0 && y2<0)
		{
			printf("Точки лежат в 4-ой четверти.\nПериметр треугольника=%lf\n",P);
		}
		if(x1<0 && y1<0 && x2<0 && y2<0)
		{
			printf("Точки лежат в 3-ей четверти,\nПериметр треугольника=%lf\n",P);
		}
		if(x1<0 && y1>0 && x2<0 && y2>0)
		{
			printf("Точки лежат во 2-ой четверти четверти,\nПериметр треугольника=%lf\n",P);
		}
	
		if((x1>0 && y1<0 && x2>0 && y2>0)\
		 ||(x1>0 && y1>0 && x2>0 && y2<0)\
		 ||(x1<0 && y1<0 && x2<0 && y2>0)\
		 ||(x1>0 && y1>0 && x2<0 && y2>0)\
		 ||(x1<0 && y1>0 && x2>0 && y2>0)\
		 ||(x1<0 && y1>0 && x2<0 && y2<0)\
		 ||(x1<0 && y1<0 && x2>0 && y2<0)\
		 ||(x1>0 && y1<0 && x2<0 && y2<0))\
		{
			printf("Точки лежат в одной полуплоскости\n");
		}
		else//if(x1>0 && y1>0 && x2<0 && y2<0 || x1<0 && y1>0 && x2>0 && y2<0 )
		{
			printf("Точки находятся в разных четвертях и полуплоскостях\n");
		}
	}	
	return 0;
	system("pause");
}
